### In this notebook, process data variables for New York outlets for Shake Shack 

### This notebook will create the dataset, New_York

In [1]:
import numpy as np
import pandas as pd
import plotly

plotly.offline.init_notebook_mode(connected=True)

# I. Collect Data Frames

### retrieve Shake Shack data and create two new columns

In [2]:
#Retrieve Shack Shack Data
df_ss_msp = pd.read_csv('./data/ss_msp.csv', header = None)
df_ss_upper_west_side = pd.read_csv('./data/ss_upper_west_side.csv', header = None)
df_ss_queens = pd.read_csv('./data/ss_queens.csv', header = None)
df_ss_upper_east_side = pd.read_csv('./data/ss_upper_east_side.csv', header = None)
df_ss_miami_beach = pd.read_csv('./data/ss_miami_beach.csv', header = None)
df_ss_hells_kitchen = pd.read_csv('./data/ss_hells_kitchen.csv', header = None)
df_ss_saratoga_springs = pd.read_csv('./data/ss_saratoga_springs.csv', header = None)
df_ss_dupont_circle = pd.read_csv('./data/ss_dupont_circle.csv', header = None)
df_ss_battery_park = pd.read_csv('./data/ss_battery_park.csv', header = None)
df_ss_navy_yard = pd.read_csv('./data/ss_navy_yard.csv', header = None)

In [3]:
df_ss_msp['outlet'] = ['Madison SP'] * df_ss_msp.shape[0]
df_ss_upper_west_side['outlet'] = ['Upper WS'] * df_ss_upper_west_side.shape[0]
df_ss_queens['outlet'] = ['Queens'] * df_ss_queens.shape[0]
df_ss_upper_east_side['outlet'] = ['Upper ES'] * df_ss_upper_east_side.shape[0]
df_ss_miami_beach['outlet'] = ['Miami Beach'] * df_ss_miami_beach.shape[0]
df_ss_hells_kitchen['outlet'] = ['Hells Kitchen'] * df_ss_hells_kitchen.shape[0]
df_ss_saratoga_springs['outlet'] = ['Saratoga S'] * df_ss_saratoga_springs.shape[0]
df_ss_dupont_circle['outlet'] = ['Dupont Circle'] * df_ss_dupont_circle.shape[0]
df_ss_battery_park['outlet'] = ['Battery Park'] * df_ss_battery_park.shape[0]
df_ss_navy_yard['outlet'] = ['Navy Yard'] * df_ss_navy_yard.shape[0]

### collect all data frames into a list and create one data frame

In [4]:
frames = [df_ss_msp, 
          df_ss_upper_west_side, 
          df_ss_queens, 
          df_ss_upper_east_side, 
          df_ss_miami_beach, 
          df_ss_hells_kitchen, 
          df_ss_saratoga_springs, 
          df_ss_dupont_circle,
          df_ss_battery_park, 
          df_ss_navy_yard]
df_orig = pd.concat(frames)

In [5]:
df_orig.columns = ['name', 'location', 'friends', 'reviews', 'photos', 'elite', 'review_date', 'rating', 
              'check_in', 'content', 'useful', 'date_reply', 'outlet']

### select relevant columns for now

In [6]:
df = df_orig[['name', 'location', 'review_date', 'rating', 'content', 'date_reply', 'outlet']].copy()

In [7]:
df.head()

,name,location,review_date,rating,content,date_reply,outlet
0,Dorota M.,"Fairview, NJ",4/14/2018,5.0,"The best burgers ever!! Fresh, delicious, exce...",NaN,Madison SP
1,John F.,"New York, NY",5/5/2018,2.0,Shake Shack: The Slowest Fast Food EverGot on ...,NaN,Madison SP
2,Alexander A.,"New York, NY",5/3/2018,3.0,"Overall - overhyped, always crowded, mediocre...",NaN,Madison SP
3,Heng Woon O.,"San Mateo, CA",5/2/2018,1.0,Horrible service! My wife waited so long for a...,NaN,Madison SP
4,Jose C.,"Chicago, IL",4/15/2018,4.0,Shake Shack makes one damn delicious burger th...,NaN,Madison SP

In [8]:
df.shape

(14627, 7)

# II. Process Variables

### get reviewer's name

In [9]:
def get_name(x):    
    try:
        a = x.split(' ')
        a.pop()
        return ''.join(a)
    except:
        return x

df['name'] = df['name'].apply(lambda x: get_name(x))

In [10]:
df.head()

,name,location,review_date,rating,content,date_reply,outlet
0,Dorota,"Fairview, NJ",4/14/2018,5.0,"The best burgers ever!! Fresh, delicious, exce...",NaN,Madison SP
1,John,"New York, NY",5/5/2018,2.0,Shake Shack: The Slowest Fast Food EverGot on ...,NaN,Madison SP
2,Alexander,"New York, NY",5/3/2018,3.0,"Overall - overhyped, always crowded, mediocre...",NaN,Madison SP
3,HengWoon,"San Mateo, CA",5/2/2018,1.0,Horrible service! My wife waited so long for a...,NaN,Madison SP
4,Jose,"Chicago, IL",4/15/2018,4.0,Shake Shack makes one damn delicious burger th...,NaN,Madison SP

### get state

In [11]:
#Location 
def get_origin(x):
    try:
        return x.split(',')[-1].strip()
    except:
        return x

df['state'] = df['location'].apply(lambda x: get_origin(x))

In [12]:
df['state'].unique()

array(['NJ', 'NY', 'CA', 'IL', 'FL', 'PA', 'TN', 'MA', 'HI', 'Canada',
       'DC', 'NC', 'United Kingdom', 'OH', 'RI', 'Norway', 'WA', 'OR',
       'CT', 'GA', 'MI', 'IA', 'TX', 'KS', 'DE', 'Australia', 'VA', 'CO',
       'Brazil', 'Italy', 'LA', 'Germany', 'WI', 'AR', 'Austria',
       'The Netherlands', 'France', 'Denmark', 'Hong Kong', 'NV', 'IN',
       'UT', 'AZ', 'MD', 'ME', 'MO', 'ID', 'WV', 'Guam', 'Sweden', 'MN',
       'Philippines', 'AL', 'Singapore', 'NE', 'KY', 'Bay Area', 'SC',
       'NM', 'MS', 'Spain', 'MT', 'OK', 'Taiwan', 'ND', 'AK', 'NH',
       'Puerto Rico', 'Japan', 'Mexico', 'New Zealand', 'Switzerland',
       'Finland', 'VT', 'Poland', 'Czech Republic', 'WY', 'Belgium',
       'Republic of Ireland', 'Argentina', 'SD', 'Malaysia', nan,
       'Turkey', 'Portugal', 'Everywhere Branch', 'ロックビル',
       'Inland Empire', 'U.S. Virgin Islands'], dtype=object)

### create locality variable

In [13]:
def get_locality(x):
    if x == 'NY':
        return 'Local'
    else:
        return 'Non-local'

df['locality'] = df['state'].apply(lambda x: get_locality(x))

In [14]:
df[['location', 'locality']].head()

        location   locality
0   Fairview, NJ  Non-local
1   New York, NY      Local
2   New York, NY      Local
3  San Mateo, CA  Non-local
4    Chicago, IL  Non-local

In [15]:
df[['location', 'locality']].groupby(['locality']).count()

           location
locality
Local          5702
Non-local      8922

In [15]:
df['state'].unique()

array(['NJ', 'NY', 'CA', 'IL', 'FL', 'PA', 'TN', 'MA', 'HI', 'Canada',
       'DC', 'NC', 'United Kingdom', 'OH', 'RI', 'Norway', 'WA', 'OR',
       'CT', 'GA', 'MI', 'IA', 'TX', 'KS', 'DE', 'Australia', 'VA', 'CO',
       'Brazil', 'Italy', 'LA', 'Germany', 'WI', 'AR', 'Austria',
       'The Netherlands', 'France', 'Denmark', 'Hong Kong', 'NV', 'IN',
       'UT', 'AZ', 'MD', 'ME', 'MO', 'ID', 'WV', 'Guam', 'Sweden', 'MN',
       'Philippines', 'AL', 'Singapore', 'NE', 'KY', 'Bay Area', 'SC',
       'NM', 'MS', 'Spain', 'MT', 'OK', 'Taiwan', 'ND', 'AK', 'NH',
       'Puerto Rico', 'Japan', 'Mexico', 'New Zealand', 'Switzerland',
       'Finland', 'VT', 'Poland', 'Czech Republic', 'WY', 'Belgium',
       'Republic of Ireland', 'Argentina', 'SD', 'Malaysia', nan,
       'Turkey', 'Portugal', 'Everywhere Branch', 'ロックビル',
       'Inland Empire', 'U.S. Virgin Islands'], dtype=object)

### create US or foreign variable

In [16]:
def get_country(x):
    if x in ['NJ', 'NY', 'CA', 'IL', 'FL', 'PA', 'TN', 'MA', 'HI', 
       'DC', 'NC', 'OH', 'RI', 'WA', 'OR',
       'CT', 'GA', 'MI', 'IA', 'TX', 'KS', 'DE', 'VA', 'CO',
       'LA', 'WI', 'AR', 
       'NV', 'IN',
       'UT', 'AZ', 'MD', 'ME', 'MO', 'ID', 'WV', 'MN',
       'AL', 'NE', 'KY', 'Bay Area', 'SC',
       'NM', 'MS', 'MT', 'OK', 'ND', 'AK', 'NH',
       'Puerto Rico', 
       'VT', 'WY', 
       'SD']:
        return 'US'
    else:
        return 'Non-US'

df['country'] = df['state'].apply(lambda x: get_country(x))

In [17]:
df[['location', 'country']].head()

        location country
0   Fairview, NJ      US
1   New York, NY      US
2   New York, NY      US
3  San Mateo, CA      US
4    Chicago, IL      US

In [18]:
df[['location', 'country']].groupby(['country']).count()

         location
country
Non-US        505
US          14119

### create new column date as review date in date format

In [19]:
def transform(x):
    date = x.split('\n')[0]    
    lis = date.split('/')[::-1]
    if len(lis[1]) == 1:
        lis[1] = ''.join(['0',lis[1]])
    if len(lis[2]) == 1:
        lis[2] = ''.join(['0',lis[2]])
    return '-'.join([lis[0],lis[2],lis[1]])

df['date'] = df['review_date'].apply(lambda x: transform(x))

In [20]:
df['date'] = pd.to_datetime(df['date'])

In [21]:
df.head()

,name,location,review_date,rating,content,date_reply,outlet,state,locality,country,date
0,Dorota,"Fairview, NJ",4/14/2018,5.0,"The best burgers ever!! Fresh, delicious, exce...",NaN,Madison SP,NJ,Non-local,US,2018-04-14
1,John,"New York, NY",5/5/2018,2.0,Shake Shack: The Slowest Fast Food EverGot on ...,NaN,Madison SP,NY,Local,US,2018-05-05
2,Alexander,"New York, NY",5/3/2018,3.0,"Overall - overhyped, always crowded, mediocre...",NaN,Madison SP,NY,Local,US,2018-05-03
3,HengWoon,"San Mateo, CA",5/2/2018,1.0,Horrible service! My wife waited so long for a...,NaN,Madison SP,CA,Non-local,US,2018-05-02
4,Jose,"Chicago, IL",4/15/2018,4.0,Shake Shack makes one damn delicious burger th...,NaN,Madison SP,IL,Non-local,US,2018-04-15

In [22]:
df.head()

,name,location,review_date,rating,content,date_reply,outlet,state,locality,country,date
0,Dorota,"Fairview, NJ",4/14/2018,5.0,"The best burgers ever!! Fresh, delicious, exce...",NaN,Madison SP,NJ,Non-local,US,2018-04-14
1,John,"New York, NY",5/5/2018,2.0,Shake Shack: The Slowest Fast Food EverGot on ...,NaN,Madison SP,NY,Local,US,2018-05-05
2,Alexander,"New York, NY",5/3/2018,3.0,"Overall - overhyped, always crowded, mediocre...",NaN,Madison SP,NY,Local,US,2018-05-03
3,HengWoon,"San Mateo, CA",5/2/2018,1.0,Horrible service! My wife waited so long for a...,NaN,Madison SP,CA,Non-local,US,2018-05-02
4,Jose,"Chicago, IL",4/15/2018,4.0,Shake Shack makes one damn delicious burger th...,NaN,Madison SP,IL,Non-local,US,2018-04-15

### extract year, month, and day as new columns (helps in sorting!)

In [23]:
#Year
def get_year(x):
    return int(x.year) 

df['year'] = df['date'].apply(lambda x: get_year(x))

In [24]:
df[['date','year']].head()

        date  year
0 2018-04-14  2018
1 2018-05-05  2018
2 2018-05-03  2018
3 2018-05-02  2018
4 2018-04-15  2018

In [25]:
#Month
def get_month(x):
    return int(x.month) 

df['month'] = df['date'].apply(lambda x: get_month(x))

In [26]:
df[['date','month']].head()

        date  month
0 2018-04-14      4
1 2018-05-05      5
2 2018-05-03      5
3 2018-05-02      5
4 2018-04-15      4

In [27]:
#Day
def get_day(x):
    return int(x.day) 

df['day'] = df['date'].apply(lambda x: get_day(x))

In [28]:
df[['date','day']].head()

        date  day
0 2018-04-14   14
1 2018-05-05    5
2 2018-05-03    3
3 2018-05-02    2
4 2018-04-15   15

### create new columns date_month and date_year for barcharts

In [29]:
def get_date_year(x):
    return str(x.year) 

df['date_year'] = df['date'].apply(lambda x: get_date_year(x))
df['date_year'] = pd.to_datetime(df['date_year'])
df[['date','date_year']].head()

        date  date_year
0 2018-04-14 2018-01-01
1 2018-05-05 2018-01-01
2 2018-05-03 2018-01-01
3 2018-05-02 2018-01-01
4 2018-04-15 2018-01-01

In [30]:
def get_date_month(x):
    return str(x.year) + '-' + str(x.month)

df['date_month'] = df['date'].apply(lambda x: get_date_month(x))
df['date_month'] = pd.to_datetime(df['date_month'])
df[['date','date_month']].head()

        date date_month
0 2018-04-14 2018-04-01
1 2018-05-05 2018-05-01
2 2018-05-03 2018-05-01
3 2018-05-02 2018-05-01
4 2018-04-15 2018-04-01

# III. Save Dataset

In [31]:
df.to_pickle('./Data/New_York')